pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND36 */
#define IFX_CAN_N_NDAT2_ND36_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND36 */
#define IFX_CAN_N_NDAT2_ND36_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND36 */
#define IFX_CAN_N_NDAT2_ND36_OFF (4u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND37 */
#define IFX_CAN_N_NDAT2_ND37_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND37 */
#define IFX_CAN_N_NDAT2_ND37_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND37 */
#define IFX_CAN_N_NDAT2_ND37_OFF (5u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND38 */
#define IFX_CAN_N_NDAT2_ND38_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND38 */
#define IFX_CAN_N_NDAT2_ND38_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND38 */
#define IFX_CAN_N_NDAT2_ND38_OFF (6u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND39 */
#define IFX_CAN_N_NDAT2_ND39_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND39 */
#define IFX_CAN_N_NDAT2_ND39_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND39 */
#define IFX_CAN_N_NDAT2_ND39_OFF (7u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND40 */
#define IFX_CAN_N_NDAT2_ND40_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND40 */
#define IFX_CAN_N_NDAT2_ND40_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND40 */
#define IFX_CAN_N_NDAT2_ND40_OFF (8u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND41 */
#define IFX_CAN_N_NDAT2_ND41_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND41 */
#define IFX_CAN_N_NDAT2_ND41_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND41 */
#define IFX_CAN_N_NDAT2_ND41_OFF (9u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND42 */
#define IFX_CAN_N_NDAT2_ND42_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND42 */
#define IFX_CAN_N_NDAT2_ND42_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND42 */
#define IFX_CAN_N_NDAT2_ND42_OFF (10u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND43 */
#define IFX_CAN_N_NDAT2_ND43_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND43 */
#define IFX_CAN_N_NDAT2_ND43_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND43 */
#define IFX_CAN_N_NDAT2_ND43_OFF (11u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND44 */
#define IFX_CAN_N_NDAT2_ND44_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND44 */
#define IFX_CAN_N_NDAT2_ND44_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND44 */
#define IFX_CAN_N_NDAT2_ND44_OFF (12u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND45 */
#define IFX_CAN_N_NDAT2_ND45_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND45 */
#define IFX_CAN_N_NDAT2_ND45_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND45 */
#define IFX_CAN_N_NDAT2_ND45_OFF (13u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND46 */
#define IFX_CAN_N_NDAT2_ND46_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND46 */
#define IFX_CAN_N_NDAT2_ND46_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND46 */
#define IFX_CAN_N_NDAT2_ND46_OFF (14u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND47 */
#define IFX_CAN_N_NDAT2_ND47_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND47 */
#define IFX_CAN_N_NDAT2_ND47_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND47 */
#define IFX_CAN_N_NDAT2_ND47_OFF (15u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND48 */
#define IFX_CAN_N_NDAT2_ND48_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND48 */
#define IFX_CAN_N_NDAT2_ND48_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND48 */
#define IFX_CAN_N_NDAT2_ND48_OFF (16u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND49 */
#define IFX_CAN_N_NDAT2_ND49_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND49 */
#define IFX_CAN_N_NDAT2_ND49_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND49 */
#define IFX_CAN_N_NDAT2_ND49_OFF (17u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND50 */
#define IFX_CAN_N_NDAT2_ND50_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND50 */
#define IFX_CAN_N_NDAT2_ND50_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND50 */
#define IFX_CAN_N_NDAT2_ND50_OFF (18u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND51 */
#define IFX_CAN_N_NDAT2_ND51_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND51 */
#define IFX_CAN_N_NDAT2_ND51_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND51 */
#define IFX_CAN_N_NDAT2_ND51_OFF (19u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND52 */
#define IFX_CAN_N_NDAT2_ND52_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND52 */
#define IFX_CAN_N_NDAT2_ND52_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND52 */
#define IFX_CAN_N_NDAT2_ND52_OFF (20u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND53 */
#define IFX_CAN_N_NDAT2_ND53_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND53 */
#define IFX_CAN_N_NDAT2_ND53_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND53 */
#define IFX_CAN_N_NDAT2_ND53_OFF (21u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND54 */
#define IFX_CAN_N_NDAT2_ND54_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND54 */
#define IFX_CAN_N_NDAT2_ND54_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND54 */
#define IFX_CAN_N_NDAT2_ND54_OFF (22u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND55 */
#define IFX_CAN_N_NDAT2_ND55_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND55 */
#define IFX_CAN_N_NDAT2_ND55_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND55 */
#define IFX_CAN_N_NDAT2_ND55_OFF (23u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND56 */
#define IFX_CAN_N_NDAT2_ND56_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND56 */
#define IFX_CAN_N_NDAT2_ND56_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND56 */
#define IFX_CAN_N_NDAT2_ND56_OFF (24u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND57 */
#define IFX_CAN_N_NDAT2_ND57_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND57 */
#define IFX_CAN_N_NDAT2_ND57_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND57 */
#define IFX_CAN_N_NDAT2_ND57_OFF (25u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND58 */
#define IFX_CAN_N_NDAT2_ND58_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND58 */
#define IFX_CAN_N_NDAT2_ND58_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND58 */
#define IFX_CAN_N_NDAT2_ND58_OFF (26u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND59 */
#define IFX_CAN_N_NDAT2_ND59_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND59 */
#define IFX_CAN_N_NDAT2_ND59_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND59 */
#define IFX_CAN_N_NDAT2_ND59_OFF (27u)

